/*
********************************************************************************
*  文 件 名：GDW376_Table.c 
*
*  文件描述：GDW376.1通讯和645通讯用到的表格。
*
*  所用芯片：
*
*  创 建 人：
*
*  版 本 号：
*
*  修改记录：
********************************************************************************
*/
#include "GDW376_CFG.h"

///{//;AFN=09H用到的表格
/*------------------------------------------------------------------------------
||   L(T,N,L,X) CSAddr
||   T = 1 : 终端参数
||   N: 支持的单元数，L：每个单元长度，X = Len - N * L，CSAddrs: 终端参数地址
------------------------------------------------------------------------------*/ 
#define L(T,N,L,X)   T+N*0x100+L*0x10000+X*0x1000000

/*B1 ZDCFG_F1[41] = {
                  'Z','H','G','C',                      //;厂商代号
                  '2','0','1','1','0','0','0','0',      //;设备编号
                  '1','.','0','0',                      //;软件版本号
                  0x10, 0x12, 0x12,                     //;软件发布日期
                  '1','6','M',0,0,0,0,0,0,0,0,  //;终端配置容量信息码
                  '3','7','6','1',                      //;通信协议版本号
                  '1','.','0','0',                      //;硬件版本号
                  0x10, 0x10, 0x11                     //;硬件发布日期
                  };*/

B1 ZDCFG_F1[41] = {
                  'Z','H','G','C',                      //;厂商代号
                  '2','0','1','5','G','W','W','X',      //;设备编号
                  /*'1','.','2','1',                    //;软件版本号
                  0x26, 0x12, 0x14,                     //;软件发布日期
                  */
                  VERSION,                              //;软件版本号
                  VERSION_DATE,                         //;软件发布日期
                  '1','6','M',0,0,0,0,0,0,0,0,  //;终端配置容量信息码
                  '3','7','6','1',                      //;通信协议版本号
                  '1','.','0','6',                      //;硬件版本号
                  0x01, 0x12, 0x14                     //;硬件发布日期
                  };

/*
B1 ZDCFG_F2[41] = {
                  0x02, 0x02,    //;脉冲量/开关量输入路数
                  0x02, 0x02,    //;直流模拟量输入/开关量输出路数
                  0x0A, 0x00,    //;支持的电能表装置最多个数
                  0xF4, 0x01,    //;接收缓存区字节数500
                  0xF4, 0x01,    //;发送缓存区字节数500
                  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, //;终端MAC地址
                  0x02,          //;通信端口数量
                  0x01, 0x00,    //;第一个通信端口的端口号及信息字
                  0x80, 0x25, 0x00, 0x00,             //;支持的最高波特率9600  
                  0x08, 0x00,    //;支持设备的个数
                  0xF4, 0x01,    //;接收缓存区字节数500
                  0xF4, 0x01,    //;发送缓存区字节数500
                  0x01, 0x00,    //;第二个通信端口的端口号及信息字
                  0x80, 0x25, 0x00, 0x00,             //;支持的最高波特率9600  
                  0x08, 0x00,    //;支持设备的个数
                  0xF4, 0x01,    //;接收缓存区字节数500
                  0xF4, 0x01     //;发送缓存区字节数500                                                 
                  };   
*/
B1 ZDCFG_F2[41] = {
                  0x00, 0x01,    //;脉冲量/开关量输入路数
                  0x00, 0x01,    //;直流模拟量输入/开关量输出路数
                  0x0A, 0x00,    //;支持的电能表装置最多个数
                  0x26, 0x02,    //;接收缓存区字节数550
                  0xF2, 0x03,    //;发送缓存区字节数1010
                  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, //;终端MAC地址
                  0x02,          //;通信端口数量
                  0x01, 0x00,    //;第一个通信端口的端口号及信息字
                  0x80, 0x25, 0x00, 0x00,             //;支持的最高波特率9600  
                  0x08, 0x00,    //;支持设备的个数
                  0x00, 0x01,    //;接收缓存区字节数256
                  0x00, 0x01,    //;发送缓存区字节数256
                  0x01, 0x00,    //;第二个通信端口的端口号及信息字
                  0x80, 0x25, 0x00, 0x00,             //;支持的最高波特率9600  
                  0x08, 0x00,    //;支持设备的个数
                  0x00, 0x01,    //;接收缓存区字节数256
                  0x00, 0x01     //;发送缓存区字节数256                                                 
                  };   

/*
B1 ZDCFG_F3[35] = {
                  0x0A, 0x00,  //;支持最多点数16
                  0x00,         //;支持总加组组数0  
                  0x08,         //;支持最多任务个数8
                  0x00,         //;支持有功总电能量差动组组数0
                  0x04,         //;支持最大费率数
                  0x01, 0x00, 0x00, 0x00, 0x00, //;支持测量点最大冻结密度及其他
                  0x1F,         //;支持日数据存放天数 31
                  0x0C,         //;支持月数据存放月数 12
                  0x00,         //;支持时段功控定值方案 0
                  0x00,         //;支持谐波检测最高谐波次数 0
                  0x00,         //;支持无功补偿电容器组最多组数 0
                  0x02,         //;支持台区集中抄表重点户最多户数 2
                  0x01, 0x00,   //;支持用户大类号标志 1
                  0x0A, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, //;0~7号小类号
                  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 //;8~16号小类号
                  }; 
*/

B1 ZDCFG_F3[35] = {
                  0x0A, 0x00,  //;支持最多点数16
                  0x00,         //;支持总加组组数0  
                  0x08,         //;支持最多任务个数8
                  0x00,         //;支持有功总电能量差动组组数0
                  0x04,         //;支持最大费率数
                  0x01, 0x00, 0x00, 0x00, 0x00, //;支持测量点最大冻结密度及其他
                  0x1F,         //;支持日数据存放天数 31
                  0x0C,         //;支持月数据存放月数 12
                  0x00,         //;支持时段功控定值方案 0
                  0x00,         //;支持谐波检测最高谐波次数 0
                  0x00,         //;支持无功补偿电容器组最多组数 0
                  0x00,         //;支持台区集中抄表重点户最多户数 0
                  0x01, 0x00,   //;支持用户大类号标志 1
                  0x0A, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, //;0~7号小类号
                  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 //;8~16号小类号
                  }; 

/*
B1 ZDCFG_F4[12] = {
                  0x0B,         //;支持参数配置信息类组数
                  0xFF, 0xFF, 0x7F, 0x7F, 0xFF,
                  0xFF, 0x01, 0x1F, 0x0F, 0x0F,
                  0x07
                  };
*/
B1 ZDCFG_F4[12] = {
                  0x0B,         //;支持参数配置信息类组数
                  0xFF, 0x8B, 0x00, 0x0B, 0x09,
                  0x00, 0x00, 0x85, 0x0F, 0x00,
                  0x00
                  };
/*
B1 ZDCFG_F5[8] = {
                  0x07,         //;支持控制参数类组数
                  0x02, 0x00, 0x00, 0x54, 0x74,
                  0x00, 0x1F
                  };        
*/

B1 ZDCFG_F5[8] = {
                  0x07,         //;支持控制参数类组数
                  0x00, 0x00, 0x00, 0x40, 0x20,
                  0x00, 0x00
                  };      
/*
B1 ZDCFG_F6[25] = {
                  0x01, 0x00,   //;支持用户大类号标志
                  0x16,         //;支持1类数据配置的信息类组数
                  0xFE, 0x07, 0x00, 0xFF, 0xFF,
                  0xFF, 0x01, 0x00, 0x00, 0x00,
                  0x00, 0xFF, 0x7F, 0xFF, 0x0F,
                  0x00, 0xFF, 0xFF, 0xFF, 0xFF,
                  0x00, 0x00
                  };    
*/
B1 ZDCFG_F6[25] = {
                  0x01, 0x00,   //;支持用户大类号标志
                  0x16,         //;支持1类数据配置的信息类组数
                  0xFE, 0x07, 0x00, 0xFF, 0xFF,
                  0xFF, 0x01, 0x00, 0x00, 0x00,
                  0x00, 0xFF, 0x7F, 0xFF, 0x0F,
                  0x00, 0xFF, 0xFF, 0xFF, 0x00,
                  0x30, 0x00
                  }; 

/*				  
B1 ZDCFG_F7[31] = {
                  0x01, 0x00,   //;支持用户大类号标志
                  0x1C,         //;支持2类数据配置的信息类组数
                  0xFF, 0x0F, 0xFF, 0xFF, 0x7F,
                  0xFF, 0x3F, 0x00, 0x00, 0x00,
                  0xFF, 0x7F, 0xFF, 0x3F, 0x00,
                  0x00, 0x00, 0x00, 0x0F, 0xFF,
                  0xFF, 0xFF, 0xFF, 0xFF, 0x0F,
                  0xFF, 0x00, 0x00
                  };
*/
B1 ZDCFG_F7[31] = {
                  0x01, 0x00,   //;支持用户大类号标志
                  0x1C,         //;支持2类数据配置的信息类组数
                  0xFF, 0x0F, 0xFF, 0xFF, 0x7F,
                  0xFF, 0x3F, 0x00, 0x00, 0x00,
                  0xFF, 0x7F, 0xFF, 0x3F, 0x00,
                  0x00, 0x00, 0x00, 0x0F, 0xFF,
                  0xFF, 0xFF, 0xFF, 0xFF, 0x0F,
                  0x00, 0x30, 0x00
                  };

/*
B1 ZDCFG_F8[8] =  {
                  0x85, 0x1F, 0x81, 0xFF,
                  0x01, 0x00, 0x00, 0x00
                  };                          
*/          
B1 ZDCFG_F8[8] =  {
                  0x85, 0x32, 0x99, 0x17, 
                  0x00, 0x00, 0x00, 0x00
                  };      


B4 ZDCFGZU[] = {
               L(0, 0, 0,  0), 0, //;起始，无用
               L(1, 0, 41, 0), (u32)ZDCFG_F1,
               L(1, 0, 41, 0), (u32)ZDCFG_F2,
               L(1, 0, 35, 0), (u32)ZDCFG_F3,
               L(1, 0, 12, 0), (u32)ZDCFG_F4,
               L(1, 0,  8, 0), (u32)ZDCFG_F5,
               L(1, 0, 25, 0), (u32)ZDCFG_F6,
               L(1, 0, 31, 0), (u32)ZDCFG_F7,
               L(1, 0,  8, 0), (u32)ZDCFG_F8
              };
//}

///{//;AFN=04和AFN=0A用到的表格
/*------------------------------------------------------------------------------
||              对应 AFN=04(设置参数) AFN=0A(查询参数)用到的表格
||
||  L(T,N,L,X) CSAddr
||  T = 1 : 终端参数
||      N: 支持的单元数，L：每个单元长度，X = Len - N * L，CSAddrs: 终端参数地址
||  T = 2 : 测量点参数
||      N: 支持的单元数，  L：每个单元长度， X:同上，CSAddrs: PoPStr结构中的偏移
||  T = 3 : 任务参数
||      N: 支持的任务个数，L：任务单元长度， X:同上，CSAddrs: 任务参数首地址
||  T = 4 : 总加组参数
||          不支持
||  T = 5 : 控制轮次
||          不支持
||  T = 6 : 直流模拟点号
||          不支持
||  T = 9 : 自定义 注：参数常量都为9，数据在程序里组织
--------------------------------------------------------------------------------*/



//;struct PoPStr 中的偏移
#define  _PF25     0
#define  _PF26     (_PF25 + 11)
#define  _PF27     (_PF26 + 57)
#define  _PF28     (_PF27 + 24)
#define  _PF29     (_PF28 + 4 )
#define  _PF30     (_PF29 + 12)
#define  _PF31     (_PF30 + 1)
#define  _PF73     (_PF31 + 25)
#define  _PF74     (_PF73 + 48)
#define  _PF75     (_PF74 + 10)
#define  _PF76     (_PF75 + 16)

B4 ZDCSZU[] = {
              L(0, 0,        0,  0), 0, //;起始，无用
              L(1, 0,        6,  0), (u32)&ZDP.F1.RTS,      //;第1组
              L(1, 16,       2,  1), (u32)&ZDP.F2.En_Num,
              L(1, 0,        28, 0), (u32)ZDP.F3.IP1,
              L(1, 0,        16, 0), (u32)ZDP.F4.Tel_Code,
              L(1, 0,        3,  0), (u32)&ZDP.F5.Code,
              L(1, 0,        16, 0), (u32)ZDP.F6.Addr1,
              L(1, 0,        64, 0), (u32)ZDP.F7.ZDIP,
              L(1, 0,        8,  0), (u32)&ZDP.F8.WorkMode,
              L(1, 0,        16, 0), (u32)ZDP.F9.Enable,    //;第2组
              L(1, METERNUM, 27, 2), (u32)ZDP.F10.MeterNum,
              L(1, PULSENUM, 5,  1), (u32)&ZDP.F11.PuNum,
              L(1, 0,        2,  0), (u32)&ZDP.F12.ZTL_Flag,
              L(1, SIMULNUM, 3,  1), (u32)&ZDP.F13.SimulNum,
              L(1, GRPPTNUM, 10, 1), (u32)&ZDP.F14.GRPNum,
              L(1, 8,        9,  1), (u32)&ZDP.F15.PEENum,
              L(1, 0,        64, 0), (u32)ZDP.F16.User,
              L(1, 0,        2,  0), (u32)ZDP.F17,          //;第3组
              L(1, 0,        12, 0), (u32)ZDP.F18,
              L(1, 0,        1,  0), (u32)ZDP.F19,
              L(1, 0,        1,  0), (u32)ZDP.F20,
              L(1, 0,        25, 0), (u32)ZDP.F21,
              L(1, 0,        17, 0), (u32)&ZDP.F22.RateN,
              L(1, 0,        3,  0), (u32)ZDP.F23,
              L(0, 0,        0,  0), 0,
              L(2, 0,        11 ,0), _PF25,                 //;第4组
              L(2, 0,        57, 0), _PF26,
              L(2, 0,        24, 0), _PF27,
              L(2, 0,        4,  0), _PF28,
              L(2, 0,        12, 0), _PF29,
              L(2, 0,        1,  0), _PF30,
              L(2, NODENUM,  6,  1), _PF31,
              L(0, 0,        0,  0), 0,
              L(1, PORTNUM,  30, 1), (u32)&ZDP.F33.PortN,   //;第5组
              L(1, PORTNUM,  6,  1), (u32)&ZDP.F34.PortN,
              L(1, KEYMETNUM,2,  1), (u32)&ZDP.F35.UsrN,
              L(1, 0,        4,  0), (u32)&ZDP.F36,
              L(1, 0,        19, 0), (u32)&ZDP.F37.Port,
              L(1, USRSNUM,  34, 2), (u32)&ZDP.F38.UsrBIndex,
              L(1, USRSNUM,  34, 2), (u32)&ZDP.F39.UsrBIndex,
              L(0, 0,        0,  0), 0,
              L(4, 0,        52, 0), (u32)&GRPP.F41.Flag,   //;第6组
              L(4, 0,        6,  0), (u32)GRPP.F42.PValue,
              L(4, 0,        1,  0), (u32)GRPP.F43,
              L(4, 0,        8,  0), (u32)GRPP.F44.TimeS,
              L(4, 0,        1,  0), (u32)GRPP.F45,
              L(4, 0,        4,  0), (u32)GRPP.F46,
              L(4, 0,        17, 0), (u32)&GRPP.F47.BuyIndex,
              L(4, 0,        1,  0), (u32)GRPP.F48,
              L(5, 0,        1,  0), (u32)F49,              //;第7组
              L(0, 0,        0,  0), 0,
              L(0, 0,        0,  0), 0,
              L(0, 0,        0,  0), 0,
              L(9, 0,        1,  0), 0,          //;扩展F53，检测读写模块FLASH和FM24是否正常
              L(9, 0,        1,  0), 0,          //;扩展F54，读取GPRS信号大小by zrt 20130723
              L(9, 0,        6,  0), 0,          //;扩展F55，同于F1
              L(9, 0,        2,  0), 0,          //;扩展F56，
              L(1, 0,        3,  0), (u32)ZDP.F57,          //;第8组
              L(1, 0,        1,  0), (u32)ZDP.F58,
              L(1, 0,        4,  0), (u32)(&ZDP.F59.EnergyOver),
              L(1, 0,        44, 0), (u32)ZDP.F60.XBU_High,
              L(1, 0,        1,  0), (u32)ZDP.F61,
              L(0, 0,        0,  0), 0,
              L(0, 0,        0,  0), 0,
              L(0, 0,        0,  0), 0,
              L(3, 20,       4,  9), (u32)TaskP.F65,        //;第9组
              L(3, 20,       4,  9), (u32)TaskP.F66,
              L(3, 0,        1,  0), (u32)TaskP.F67,
              L(3, 0,        1,  0), (u32)TaskP.F68,
              L(0, 0,        0,  0), 0,
              L(0, 0,        0,  0), 0,
              L(0, 0,        0,  0), 0,
              L(0, 0,        0,  0), 0,
              L(2, 0,        48, 0), _PF73,                 //;第10组
              L(2, 0,        10, 0), _PF74,
              L(2, 0,        16, 0), _PF75,
              L(2, 0,        1,  0), _PF76,
              L(0, 0,        0,  0), 0,
              L(0, 0,        0,  0), 0,
              L(0, 0,        0,  0), 0,
              L(0, 0,        0,  0), 0,
              L(6, 0,        4,  0), (u32)DCPP.F81.ValueS,  //;第11组
              L(6, 0,        4,  0), (u32)DCPP.F82.ValueU,
              L(6, 0,        1,  0), (u32)DCPP.F83,
              L(0, 0,        0,  0), 0,
              L(0, 0,        0,  0), 0,
              L(0, 0,        0,  0), 0,
              L(0, 0,        0,  0), 0,
              L(0, 0,        0,  0), 0,
              L(1, 0,        4,  0), (u32)ZDPKZ.F89.QuXian, //;第12组
              L(1, 0,        3,  0), (u32)ZDPKZ.F90.ERCOCT,
              L(1, 0,        5,  0), (u32)ZDPKZ.F91.XFKT1,
              L(0, 0,        0,  0), 0,
              L(0, 0,        0,  0), 0,
              L(0, 0,        0,  0), 0,
              L(0, 0,        0,  0), 0,     
              L(0, 0,        0,  0), 0,         
              L(1, 0,        16, 0), (u32)ZDPKZ.F97.UserSend,//;第13组
              L(1, 0,        20, 0), (u32)ZDPKZ.F98,
              L(1, 0,        20, 0), (u32)ZDPKZ.F99,
              L(1, 0,        20, 0), (u32)ZDPKZ.F100,
              L(1, 0,        20, 0), (u32)ZDPKZ.F101,
              L(0, 0,        0,  0), 0,
              L(0, 0,        0,  0), 0,
              };
//}


///{//;AFN=0C用到的表格
    
/*------------------------------------------------------------------------------
||                    对应 AFN=0C 请求1类数据 用到的表格
||T--参数的类型   Pn=0  1--参数总长度固定  2--参数总长度可变(根据第一个字节改变)
||                根据测量点   3--需要判读读取那一个测量点的参数
||                0--该参数不存在
||对应 T==1  (对应终端 1个参数)
||--L--长度  参数的总长度
||--N--保留
||--X--保留
||--地址      参数的起始地址  为00表示不支持该参数
||
||对应 T==2  (对应终端 多个参数)
||--L--保留
||--N--个数  参数的个数
||--X--保留
||--地址      参数所对应的数组的起始地址  为00表示不支持该参数
||
||对应 T==3  (对应终端或测量点和总加组 需要特殊处理)
||--L--保留
||--N--个数  对用特殊处理号
||--X--保留
||--地址      参数所对应的数组的起始地址  为00表示不支持该参数
||
||对应 T==4  (对应总加组 )
||--L--保留
||--N--个数  总加组的最大支持数目
||--X--保留
||--地址     总加组对应参数的数组的其实地址  为00表示不支持该参数
||
||对应 T==5  (对应测量点 )
||--L--保留
||--N--个数  测量点的最大支持数目
||--X--保留
||--地址     测量点对应参数的数组的其实地址  为00表示不支持该参数
||
||对应 T==6  (对应测量点小时冻结参数 )
||--L--保留
||--N--个数  测量点的最大支持数目
||--X--保留
||--地址     测量点对应参数的数组的其实地址  为00表示不支持该参数
||
||对应 T==7  (对应直流模拟量点 )
||--L--保留
||--N--个数  测量点的最大支持数目
||--X--保留
||--地址     测量点对应参数的数组的其实地址  为00表示不支持该参数
||------------------------------------------------
||
||
||{//;终端参数类包含的参数列表
||对应 T==20
||--L--长度   参数的长度
||--N--保留
||--X--保留
||--地址      参数的起始地址
------------------------------------------------------------------------------*/

/***************************PnDStruct中的偏移**********************************/
//;AFN=0CH
//;以PnD->Start为首地址
#define  _CBTime    1
#define  _RC313    (_CBTime   +  5 )
#define  _T1F25    (_RC313    +  1 )
#define  _T1F26    (_T1F25    +  62)
#define  _T1F27    (_T1F26    +  52)
#define  _T1F28    (_T1F27    +  55)
#define  _T1F29    (_T1F28    +  28)
#define  _T1F30    (_T1F29    +  10)
#define  _T1F31    (_T1F30    +  10)
#define  _T1F32    (_T1F31    +  54)
#define  _T1F33    (_T1F32    +  54)
#define  _T1F34    (_T1F33    +  85)
#define  _T1F35    (_T1F34    +  85)
#define  _T1F36    (_T1F35    +  70)
#define  _T1F37    (_T1F36    +  70)
#define  _T1F38    (_T1F37    +  85)
#define  _T1F39    (_T1F38    +  85)
#define  _T1F40    (_T1F39    +  70)
#define  _T1F41    (_T1F40    +  70)
#define  _T1F42    (_T1F41    +  20)
#define  _T1F43    (_T1F42    +  20)
#define  _T1F44    (_T1F43    +  20)
#define  _T1F45    (_T1F44    +  20)
#define  _T1F46    (_T1F45    +  20)
#define  _T1F47    (_T1F46    +  20)
#define  _T1F48    (_T1F47    +  20)
#define  _T1F49    (_T1F48    +  20)
#define  _T1F57    (_T1F49    +  12)
#define  _T1F58    (_T1F57    +  0 )
#define  _T1F65    (_T1F58    +  0 )
#define  _T1F66    (_T1F65    +  0 )
#define  _T1F67    (_T1F66    +  0 )
//;小时冻
#define  _T1F89    (_T1F67    +  0 )
#define  _T1F90    (_T1F89    +  14)
#define  _T1F91    (_T1F90    +  14)
#define  _T1F92    (_T1F91    +  14)
#define  _T1F93    (_T1F92    +  14)
#define  _T1F94    (_T1F93    +  14)
#define  _T1F95    (_T1F94    +  14)
#define  _T1F96    (_T1F95    +  14)
#define  _T1F97    (_T1F96    +  14)
#define  _T1F98    (_T1F97    +  10)
#define  _T1F99    (_T1F98    +  10)
#define  _T1F100   (_T1F99    +  10)
#define  _T1F101   (_T1F100   +  14)
#define  _T1F102   (_T1F101   +  14)
#define  _T1F103   (_T1F102   +  14)
#define  _T1F105   (_T1F103   +  14)
#define  _T1F106   (_T1F105   +  18)
#define  _T1F107   (_T1F106   +  18)
#define  _T1F108   (_T1F107   +  18)
#define  _T1F109   (_T1F108   +  18)
#define  _T1F110   (_T1F109   +  18)
#define  _T1F111   (_T1F110   +  18)
#define  _T1F112   (_T1F111   +  18)
#define  _T1F113   (_T1F112   +  18)
#define  _T1F114   (_T1F113   +  10)
#define  _T1F115   (_T1F114   +  10)
#define  _T1F116   (_T1F115   +  10)
//;当前小时冻结数据偏移
#define  _T1NF89    (_T1F116  +  10)
#define  _T1NF90    (_T1NF89  +  14)
#define  _T1NF91    (_T1NF90  +  14)
#define  _T1NF92    (_T1NF91  +  14)
#define  _T1NF93    (_T1NF92  +  14)
#define  _T1NF94    (_T1NF93  +  14)
#define  _T1NF95    (_T1NF94  +  14)
#define  _T1NF96    (_T1NF95  +  14)
#define  _T1NF97    (_T1NF96  +  14)
#define  _T1NF98    (_T1NF97  +  10)
#define  _T1NF99    (_T1NF98  +  10)
#define  _T1NF100   (_T1NF99  +  10)
#define  _T1NF101   (_T1NF100 +  14)
#define  _T1NF102   (_T1NF101 +  14)
#define  _T1NF103   (_T1NF102 +  14)
#define  _T1NF105   (_T1NF103 +  14)
#define  _T1NF106   (_T1NF105 +  18)
#define  _T1NF107   (_T1NF106 +  18)
#define  _T1NF108   (_T1NF107 +  18)
#define  _T1NF109   (_T1NF108 +  18)
#define  _T1NF110   (_T1NF109 +  18)
#define  _T1NF111   (_T1NF110 +  18)
#define  _T1NF112   (_T1NF111 +  18)
#define  _T1NF113   (_T1NF112 +  18)
#define  _T1NF114   (_T1NF113 +  10)
#define  _T1NF115   (_T1NF114 +  10)
#define  _T1NF116   (_T1NF115 +  10)
//;时区冻结电能
//;#define  _T1F153   (_T1NF116 +  25) 
#define  _T1F153   (_T1NF116 +  10)     //; by zrt 20130814
#define  _T1F154   (_T1F153 +  25)
#define  _T1F155   (_T1F154 +  25)
#define  _T1F156   (_T1F155 +  25)
#define  _T1F157   (_T1F156 +  25)
#define  _T1F158   (_T1F157 +  25)
#define  _T1F159   (_T1F158 +  25)
#define  _T1F160   (_T1F159 +  25)

//;电能表操作记录及状态    by zrt 20130808  此组仅支持F165、F166
#define  _T1F161   (_T1F160 +  25)
#define  _T1F162   (_T1F161 +  0)
#define  _T1F163   (_T1F162 +  0)
#define  _T1F164   (_T1F163 +  0)
#define  _T1F165   (_T1F164 +  0)        //;编程次数及时间，开尾盖及时间
#define  _T1F166   (_T1F165 +  14)      //;电能表时钟修改次数及时间，时段参数修改次数及时间
#define  _T1F167   (_T1F166 +  14)
#define  _T1F168   (_T1F167 +  0)

//;单项电能示值
#define  _T1F129    (_T1F33   +   0)
#define  _T1F130    (_T1F129  +  25)
#define  _T1F133    (_T1F130  +  20)
#define  _T1F136    (_T1F133  +  20)

#define  _T1F131    (_T1F34   +   0)
#define  _T1F132    (_T1F131  +  25)
#define  _T1F134    (_T1F132  +  20)
#define  _T1F135    (_T1F134  +  20)

#define  _T1F137    (_T1F37   +   0)
#define  _T1F138    (_T1F137  +  25)
#define  _T1F141    (_T1F138  +  20)
#define  _T1F144    (_T1F141  +  20)

#define  _T1F139    (_T1F38   +   0)
#define  _T1F140    (_T1F139  +  25)
#define  _T1F142    (_T1F140  +  20)
#define  _T1F143    (_T1F142  +  20)
//;单项需量示值
#define  _T1F145    (_T1F35   +   0)
#define  _T1F146    (_T1F145  +  35)

#define  _T1F147    (_T1F36   +   0)
#define  _T1F148    (_T1F147  +  35)

#define  _T1F149    (_T1F39   +   0)
#define  _T1F150    (_T1F149  +  35)

#define  _T1F151    (_T1F40   +   0)
#define  _T1F152    (_T1F151  +  35)



//;终端数据//;暂时支持8个测量点
//; L(5,Len,X1,X2)
//;X1=1包含抄表日期;X1=2包括费率数;X1=3包含抄表日期和费率数;Len 数据长度

B4 PN0CZU[] = {
              L(0, 0,  0, 0), 0, //;起始，无用  
              L(0, 0,  0, 0), 0, //;第1组
              L(1, 6,  0, 0), (u32)ZDS.F2,
              L(1, 31, 0, 0), (u32)ZDS.F3,
              L(1, 1,  0, 0), (u32)ZDS.F4,
              L(1, 50, 0, 0), (u32)&ZDS.F5.InSign,
              L(1, 64, 0, 0), (u32)&ZDS.F6.TelCutStat,
              L(1, 2,  0, 0), (u32)ZDS.F7,
              L(1, 8,  0, 0), (u32)ZDS.F8,
              L(1, 2,  0, 0), (u32)ZDS.F9, //;第2组
              L(1, 8,  0, 0), (u32)&ZDS.F10.Flux_Day,
//;by zrt 20130719              L(1, 37, 0, 0), (u32)&ZDS.F11.PortN,    不需要F11,故改为否认帧
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
/*              
              L(4, 0,  0, 0), 0,       //;第3组
              L(4, 0,  0, 0), 0,
              L(4, 0,  0, 0), 0,
              L(4, 0,  0, 0), 0,
              L(4, 0,  0, 0), 0,
              L(4, 0,  0, 0), 0,
              L(4, 0,  0, 0), 0,
              L(4, 0,  0, 0), 0,
*/
//;by zrt 20130717
              L(0, 0,  0, 0), 0,       //;第3组
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(5, 62, 1, 0), _T1F25,  //;第4组
              L(5, 52, 1, 0), _T1F26,
              L(5, 55, 1, 0), _T1F27,
              L(5, 28, 1, 0), _T1F28,
//              L(5, 10, 1, 0), _T1F29,                   泰瑞捷 不需要F29,F30,故改为否认帧by zrt 20130725
//              L(5, 10, 1, 0), _T1F30,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(5, 54, 1, 0), _T1F31,
              L(5, 54, 1, 0), _T1F32,
              L(5, 85, 3, 0), _T1F33,  //;第5组
              L(5, 85, 3, 0), _T1F34,
              L(5, 70, 3, 0), _T1F35,
              L(5, 70, 3, 0), _T1F36,
              L(5, 85, 3, 0), _T1F37,
              L(5, 85, 3, 0), _T1F38,
              L(5, 70, 3, 0), _T1F39,
              L(5, 70, 3, 0), _T1F40,
              L(5, 20, 2, 0), _T1F41,  //;第6组
              L(5, 20, 2, 0), _T1F42,
              L(5, 20, 2, 0), _T1F43,
              L(5, 20, 2, 0), _T1F44,
              L(5, 20, 2, 0), _T1F45,
              L(5, 20, 2, 0), _T1F46,
              L(5, 20, 2, 0), _T1F47,
              L(5, 20, 2, 0), _T1F48,
              L(5, 12, 0, 0), _T1F49,  //;第7组
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
/*              
              L(5, 0,  0, 0), 0,        //;第8组
              L(5, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(5, 0,  0, 0), 0,        //;第9组
              L(5, 0,  0, 0), 0,
              L(5, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(7, 0,  0, 0), 0,       //;第10组
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(4, 0,  0, 0), 0,        //;第11组
              L(4, 0,  0, 0), 0,
              L(4, 0,  0, 0), 0,
              L(4, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
*/              
              L(0, 0,  0, 0), 0,        //;第8组
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,        //;第9组
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,       //;第10组
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,        //;第11组
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(6, 14, 0, 0), _T1F89,  //;第12组
              L(6, 14, 0, 0), _T1F90,
              L(6, 14, 0, 0), _T1F91,
              L(6, 14, 0, 0), _T1F92,
              L(6, 14, 0, 0), _T1F93,
              L(6, 14, 0, 0), _T1F94,
              L(6, 14, 0, 0), _T1F95,
              L(6, 14, 0, 0), _T1F96,
              L(6, 10, 0, 0), _T1F97,  //;第13组
              L(6, 10, 0, 0), _T1F98,
              L(6, 10, 0, 0), _T1F99,
              L(6, 14, 0, 0), _T1F100,
              L(6, 14, 0, 0), _T1F101,
              L(6, 14, 0, 0), _T1F102,
              L(6, 14, 0, 0), _T1F103,
              L(0, 0,  0, 0), 0,
              L(6, 18, 0, 0), _T1F105, //;第14组
              L(6, 18, 0, 0), _T1F106,
              L(6, 18, 0, 0), _T1F107,
              L(6, 18, 0, 0), _T1F108,
              L(6, 18, 0, 0), _T1F109,
              L(6, 18, 0, 0), _T1F110,
              L(6, 18, 0, 0), _T1F111,
              L(6, 18, 0, 0), _T1F112,
              L(6, 10, 0, 0), _T1F113, //;第15组
              L(6, 10, 0, 0), _T1F114,
              L(6, 10, 0, 0), _T1F115,
              L(6, 10, 0, 0), _T1F116,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(7, 0,  0, 0), 0,       //;第16组
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(5, 25, 3, 0), _T1F129, //;第17组
              L(5, 20, 3, 0), _T1F130,
              L(5, 25, 3, 0), _T1F131,
              L(5, 20, 3, 0), _T1F132,
              L(5, 20, 3, 0), _T1F133,
              L(5, 20, 3, 0), _T1F134,
              L(5, 20, 3, 0), _T1F135,
              L(5, 20, 3, 0), _T1F136,
              L(5, 25, 3, 0), _T1F137, //;第18组
              L(5, 20, 3, 0), _T1F138,
              L(5, 25, 3, 0), _T1F139,
              L(5, 20, 3, 0), _T1F140,
              L(5, 20, 3, 0), _T1F141,
              L(5, 20, 3, 0), _T1F142,
              L(5, 20, 3, 0), _T1F143,
              L(5, 20, 3, 0), _T1F144,
              L(5, 35, 3, 0), _T1F145, //;第19组
              L(5, 35, 3, 0), _T1F146,
              L(5, 35, 3, 0), _T1F147,
              L(5, 35, 3, 0), _T1F148,
              L(5, 35, 3, 0), _T1F149,
              L(5, 35, 3, 0), _T1F150,
              L(5, 35, 3, 0), _T1F151,
              L(5, 35, 3, 0), _T1F152,
/*            
              L(5, 25, 3, 0), _T1F153, //;第20组
              L(5, 25, 3, 0), _T1F154,
              L(5, 25, 3, 0), _T1F155,
              L(5, 25, 3, 0), _T1F156,
              L(5, 25, 3, 0), _T1F157,
              L(5, 25, 3, 0), _T1F158,
              L(5, 25, 3, 0), _T1F159,
              L(5, 25, 3, 0), _T1F160,               
              L(5, 0,  0, 0), 0,       //;第21组
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(5, 0,  0, 0), 0,
              L(5, 0,  0, 0), 0,
              L(5, 0,  0, 0), 0,
              L(5, 0,  0, 0), 0,
              L(5, 0,  0, 0), 0,       //;第22组
              L(5, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
*/
//;没有做的功能给否定帧
              L(0, 0,  0, 0), 0,       //;第20组
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,       //;第21组F161-F168
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(5, 14,  1, 0), _T1F165,
              L(5, 14,  1, 0), _T1F166,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,       //;第22组F169-F176
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              L(0, 0,  0, 0), 0,
              };              
//}

///{//;AFN=0D用到的表格
/*------------------------------------------------------------------------------
||  日冻结页分配
------------------------------------------------------------------------------*/
//;日冻结页0分配 512B+9B
//#define  DFP0S     9
#define  DFP0S     10	//20130926
#define  DFP0F1    DFP0S    + 0
#define  DFP0F2    DFP0F1   + 85
#define  DFP0F3    DFP0F2   + 85
#define  DFP0F4    DFP0F3   + 70
#define  DFP0F5    DFP0F4   + 70
#define  DFP0F6    DFP0F5   + 20
#define  DFP0F7    DFP0F6   + 20
#define  DFP0F8    DFP0F7   + 20
#define  DFP0F25   DFP0F8   + 20
#define  DFP0F26   DFP0F25  + 32
#define  DFP0F27   DFP0F26  + 24

//;以下标识内容与上边重合部分
#define  DFP0F161  DFP0F1   + 0
#define  DFP0F162  DFP0F161 + 25
#define  DFP0F163  DFP0F2   + 0
#define  DFP0F164  DFP0F163 + 25
#define  DFP0F165  DFP0F162 + 20
#define  DFP0F166  DFP0F164 + 20
#define  DFP0F167  DFP0F166 + 20
#define  DFP0F168  DFP0F165 + 20
#define  DFP0F185  DFP0F3   + 0
#define  DFP0F186  DFP0F185 + 35
#define  DFP0F187  DFP0F4   + 0
#define  DFP0F188  DFP0F187 + 35

//;日冻结页1分配 175B+9B
#define  DFP1S     9
#define  DFP1F28   DFP1S    + 0
#define  DFP1F29   DFP1F28  + 14
#define  DFP1F30   DFP1F29  + 38
#define  DFP1F31   DFP1F30  + 4
#define  DFP1F32   DFP1F31  + 10
#define  DFP1F49   DFP1F32  + 52
#define  DFP1F50   DFP1F49  + 4
#define  DFP1F53   DFP1F50  + 4
#define  DFP1F153  DFP1F53  + 4
#define  DFP1F154  DFP1F153 + 15
#define  DFP1F155  DFP1F154 + 12
#define  DFP1F156  DFP1F155 + 15
#define  DFP1F209  DFP1F156 + 12

/*------------------------------------------------------------------------------
||  抄表日冻结页分配
------------------------------------------------------------------------------*/
//;抄表日冻结页0分配 310B+9B
#define  RFP0S     9
#define  RFP0F9    RFP0S    + 0
#define  RFP0F10   RFP0F9   + 85
#define  RFP0F11   RFP0F10  + 85
#define  RFP0F12   RFP0F11  + 70

//;以下标识内容与上边重合部分
#define  RFP0F169  RFP0F9   + 0
#define  RFP0F170  RFP0F169 + 25
#define  RFP0F171  RFP0F10  + 0
#define  RFP0F172  RFP0F171 + 25
#define  RFP0F173  RFP0F170 + 20
#define  RFP0F174  RFP0F172 + 20
#define  RFP0F175  RFP0F174 + 20
#define  RFP0F176  RFP0F173 + 20
#define  RFP0F189  RFP0F11  + 0
#define  RFP0F190  RFP0F189 + 35
#define  RFP0F191  RFP0F12  + 0
#define  RFP0F192  RFP0F191 + 35

/*------------------------------------------------------------------------------
||  月冻结页分配
------------------------------------------------------------------------------*/
//;月冻结页0分配 512B+8B
//;#define  MFP0S     8   
#define  MFP0S     9    //20130930
#define  MFP0F17   MFP0S    + 0
#define  MFP0F18   MFP0F17  + 85
#define  MFP0F19   MFP0F18  + 85
#define  MFP0F20   MFP0F19  + 70
#define  MFP0F21   MFP0F20  + 70
#define  MFP0F22   MFP0F21  + 20
#define  MFP0F23   MFP0F22  + 20
#define  MFP0F24   MFP0F23  + 20
#define  MFP0F33   MFP0F24  + 20
#define  MFP0F34   MFP0F33  + 32
#define  MFP0F35   MFP0F34  + 24

//;以下标识内容与上边重合部分
#define  MFP0F177  MFP0F17  + 0
#define  MFP0F178  MFP0F177 + 25
#define  MFP0F179  MFP0F18  + 0
#define  MFP0F180  MFP0F179 + 25
#define  MFP0F181  MFP0F178 + 20
#define  MFP0F182  MFP0F180 + 20
#define  MFP0F183  MFP0F182 + 20
#define  MFP0F184  MFP0F181 + 20
#define  MFP0F193  MFP0F19  + 0
#define  MFP0F194  MFP0F193 + 35
#define  MFP0F195  MFP0F20  + 0
#define  MFP0F196  MFP0F195 + 35

//;月冻结页1分配 344B+8B
#define  MFP1S     8
#define  MFP1F36   MFP1S    + 0
#define  MFP1F37   MFP1F36  + 16
#define  MFP1F38   MFP1F37  + 38
#define  MFP1F39   MFP1F38  + 4
#define  MFP1F51   MFP1F39  + 12
#define  MFP1F52   MFP1F51  + 4
#define  MFP1F54   MFP1F52  + 4
#define  MFP1F157  MFP1F54  + 4
#define  MFP1F158  MFP1F157 + 15
#define  MFP1F159  MFP1F158 + 12
#define  MFP1F160  MFP1F159 + 15
#define  MFP1F201  MFP1F160 + 12
#define  MFP1F202  MFP1F201 + 25
#define  MFP1F203  MFP1F202 + 25
#define  MFP1F204  MFP1F203 + 25
#define  MFP1F205  MFP1F204 + 25
#define  MFP1F206  MFP1F205 + 25
#define  MFP1F207  MFP1F206 + 25
#define  MFP1F208  MFP1F207 + 25
#define  MFP1F213  MFP1F208 + 25
#define  MFP1F214  MFP1F213 + 14

/*------------------------------------------------------------------------------
||  曲线(Curve)冻结点内分配
------------------------------------------------------------------------------*/
//;曲线冻结点内分配 424B+5B
#define  CFP0S     5
#define  CFP0F81   CFP0S   + 0
#define  CFP0F82   CFP0F81  + 3
#define  CFP0F83   CFP0F82  + 3
#define  CFP0F84   CFP0F83  + 3
#define  CFP0F85   CFP0F84  + 3
#define  CFP0F86   CFP0F85  + 3
#define  CFP0F87   CFP0F86  + 3
#define  CFP0F88   CFP0F87  + 3
#define  CFP0F89   CFP0F88  + 3
#define  CFP0F90   CFP0F89  + 2
#define  CFP0F91   CFP0F90  + 2
#define  CFP0F92   CFP0F91  + 2
#define  CFP0F93   CFP0F92  + 3
#define  CFP0F94   CFP0F93  + 3
#define  CFP0F95   CFP0F94  + 3
#define  CFP0F97   CFP0F95  + 3
#define  CFP0F98   CFP0F97  + 4
#define  CFP0F99   CFP0F98  + 4
#define  CFP0F100  CFP0F99  + 4
#define  CFP0F101  CFP0F100 + 4
#define  CFP0F102  CFP0F101 + 4
#define  CFP0F103  CFP0F102 + 4
#define  CFP0F104  CFP0F103 + 4
#define  CFP0F105  CFP0F104 + 4
#define  CFP0F106  CFP0F105 + 2
#define  CFP0F107  CFP0F106 + 2
#define  CFP0F108  CFP0F107 + 2
#define  CFP0F109  CFP0F108 + 2
#define  CFP0F110  CFP0F109 + 6
#define  CFP0F145  CFP0F110 + 6
#define  CFP0F146  CFP0F145 + 4
#define  CFP0F147  CFP0F146 + 4
#define  CFP0F148  CFP0F147 + 4

/*------------------------------------------------------------------------------
||T--冻结类型(B3(bit0~bit2))：0-不支持,1-日,2-抄表日,3-月,4-曲线 
||A--终端抄表时间(B3(bit3))：0-不包含,1-包含 
||B--终端包含费率(B3(bit4)): 0-不包含,1-包含
||L--信息类长度(B2)
||P--数据在FLASH第几页(B3(bit5~bit7))
||S--数据在FLASH页中的起始地址(B0&B1)(当T=4，则为在一个曲线点内地址)
------------------------------------------------------------------------------*/
#define LI(T, A, B, L, P, S)   (T<<24)+(A<<27)+(B<<28)+(P<<29)+(L<<16)+(S)
B4 PN0DZU[] = {
              LI(0, 0, 0, 0,  0, 0), //;初始--无用
              
              LI(1, 1, 1, 85, 0, DFP0F1  ), //;第1组F1
              LI(1, 1, 1, 85, 0, DFP0F2  ),
              LI(1, 1, 1, 70, 0, DFP0F3  ),
              LI(1, 1, 1, 70, 0, DFP0F4  ),
              LI(1, 0, 1, 20, 0, DFP0F5  ),
              LI(1, 0, 1, 20, 0, DFP0F6  ),
              LI(1, 0, 1, 20, 0, DFP0F7  ),
              LI(1, 0, 1, 20, 0, DFP0F8  ),           
              LI(2, 1, 1, 85, 0, RFP0F9  ), //;第2组F9
              LI(2, 1, 1, 85, 0, RFP0F10 ),
              LI(2, 1, 1, 70, 0, RFP0F11 ),
              LI(2, 1, 1, 70, 0, RFP0F12 ),
              LI(0, 0, 0, 0,  0, 0       ),
              LI(0, 0, 0, 0,  0, 0       ),
              LI(0, 0, 0, 0,  0, 0       ),
              LI(0, 0, 0, 0,  0, 0       ),      
              LI(3, 1, 1, 85, 0, MFP0F17 ), //;第3组F17 
              LI(3, 1, 1, 85, 0, MFP0F18 ),
              LI(3, 1, 1, 70, 0, MFP0F19 ),
              LI(3, 1, 1, 70, 0, MFP0F20 ),
              LI(3, 0, 1, 20, 0, MFP0F21 ),
              LI(3, 0, 1, 20, 0, MFP0F22 ),
              LI(3, 0, 1, 20, 0, MFP0F23 ),
              LI(3, 0, 1, 20, 0, MFP0F24 ),   
              LI(1, 0, 0, 32, 0, DFP0F25 ), //;第4组F25
              LI(1, 0, 0, 24, 0, DFP0F26 ),
              LI(1, 0, 0, 66, 0, DFP0F27 ),
              LI(1, 0, 0, 14, 1, DFP1F28 ),
              LI(1, 0, 0, 38, 1, DFP1F29 ),
              LI(1, 0, 0, 4,  1, DFP1F30 ),
//;              LI(1, 0, 0, 10, 1, DFP1F31 ),    //by zrt 20130718  不支持F31,改为否认帧
		LI(1, 0, 0, 0, 0, 0 ),
              LI(1, 1, 0, 52, 1, DFP1F32 ),          
              LI(3, 0, 0, 32, 0, MFP0F33 ), //;第5组F33
              LI(3, 0, 0, 24, 0, MFP0F34 ),
              LI(3, 0, 0, 66, 0, MFP0F35 ),
              LI(3, 0, 0, 16, 1, MFP1F36 ),
              LI(3, 0, 0, 38, 1, MFP1F37 ),
              LI(3, 0, 0, 4,  1, MFP1F38 ),
              LI(3, 0, 0, 12, 1, MFP1F39 ),
              LI(0, 0, 0, 0,  0, 0       ),          
              LI(1, 0, 0, 0,  0, 0       ), //;第6组F41
              LI(1, 0, 0, 0,  0, 0       ),
              LI(1, 0, 0, 0,  0, 0       ),
              LI(3, 0, 0, 0,  0, 0       ),
              LI(1, 0, 0, 0,  0, 0       ),
              LI(3, 0, 0, 0,  0, 0       ),
              LI(0, 0, 0, 0,  0, 0       ),
              LI(0, 1, 0, 0,  0, 0       ),             
              LI(1, 0, 0, 4,  1, DFP1F49 ), //;第7组F49
              LI(1, 0, 0, 4,  1, DFP1F50 ),
              LI(3, 0, 0, 4,  1, MFP1F51 ),
              LI(3, 0, 0, 4,  1, MFP1F52 ),
              LI(1, 0, 0, 4,  1, DFP1F53 ),
              LI(3, 0, 0, 4,  1, MFP1F54 ),
              LI(0, 0, 0, 0,  0, 0       ),
              LI(0, 0, 0, 0,  0, 0       ),              
              LI(1, 0, 0, 0,  0, 0      ), //;第8组F57
              LI(1, 0, 0, 0,  0, 0      ),
              LI(1, 0, 0, 0,  0, 0      ),
              LI(3, 0, 0, 0,  0, 0      ),
              LI(3, 0, 0, 0,  0, 0      ),
              LI(3, 0, 0, 0,  0, 0      ),
              LI(0, 0, 0, 0,  0, 0      ),
              LI(0, 1, 0, 0,  0, 0      ),              
              LI(3, 0, 0, 0,  0, 0      ), //;第9组F65
              LI(3, 0, 0, 0,  0, 0      ),
              LI(0, 0, 0, 0,  0, 0      ),
              LI(0, 0, 0, 0,  0, 0      ),
              LI(0, 0, 0, 0,  0, 0      ),
              LI(0, 0, 0, 0,  0, 0      ),
              LI(0, 0, 0, 0,  0, 0      ),
              LI(0, 1, 0, 0,  0, 0      ),            
              LI(4, 0, 0, 0,  0, 0      ), //;第10组F73
              LI(4, 0, 0, 0,  0, 0      ),
              LI(4, 0, 0, 0,  0, 0      ),
              LI(4, 0, 0, 0,  0, 0      ),
              LI(0, 0, 0, 0,  0, 0      ),
              LI(0, 0, 0, 0,  0, 0      ),
              LI(0, 0, 0, 0,  0, 0      ),
              LI(0, 1, 0, 0,  0, 0      ),              
              LI(4, 0, 0, 3,  0, CFP0F81 ), //;第11组F81
              LI(4, 0, 0, 3,  0, CFP0F82 ),
              LI(4, 0, 0, 3,  0, CFP0F83 ),
              LI(4, 0, 0, 3,  0, CFP0F84 ),
              LI(4, 0, 0, 3,  0, CFP0F85 ),
              LI(4, 0, 0, 3,  0, CFP0F86 ),
              LI(4, 0, 0, 3,  0, CFP0F87 ),
              LI(4, 0, 0, 3,  0, CFP0F88 ),              
              LI(4, 0, 0, 2,  0, CFP0F89 ), //;第12组F89
              LI(4, 0, 0, 2,  0, CFP0F90 ),
              LI(4, 0, 0, 2,  0, CFP0F91 ),
              LI(4, 0, 0, 3,  0, CFP0F92 ),
              LI(4, 0, 0, 3,  0, CFP0F93 ),
              LI(4, 0, 0, 3,  0, CFP0F94 ),
              LI(4, 0, 0, 3,  0, CFP0F95 ),
              LI(0, 0, 0, 0,  0, 0       ),              
              LI(4, 0, 0, 4,  0, CFP0F97 ), //;第13组F97
              LI(4, 0, 0, 4,  0, CFP0F98 ),
              LI(4, 0, 0, 4,  0, CFP0F99 ),
              LI(4, 0, 0, 4,  0, CFP0F100),
              LI(4, 0, 0, 4,  0, CFP0F101),
              LI(4, 0, 0, 4,  0, CFP0F102),
              LI(4, 0, 0, 4,  0, CFP0F103),
              LI(4, 0, 0, 4,  0, CFP0F104),              
              LI(4, 0, 0, 2,  0, CFP0F105), //;第14组F105
              LI(4, 0, 0, 2,  0, CFP0F106),
              LI(4, 0, 0, 2,  0, CFP0F107),
              LI(4, 0, 0, 2,  0, CFP0F108),
              LI(4, 0, 0, 6,  0, CFP0F109),
              LI(4, 0, 0, 6,  0, CFP0F110),
              LI(0, 0, 0, 0,  0, 0       ),
              LI(0, 0, 0, 0,  0, 0       ),            
              LI(1, 0, 0, 0,  0, 0      ), //;第15组F113
              LI(1, 0, 0, 0,  0, 0      ),
              LI(1, 0, 0, 0,  0, 0      ),
              LI(1, 0, 0, 0,  0, 0      ),
              LI(1, 0, 0, 0,  0, 0      ),
              LI(1, 0, 0, 0,  0, 0      ),
              LI(0, 0, 0, 0,  0, 0      ),
              LI(0, 1, 0, 0,  0, 0      ),              
              LI(1, 0, 0, 0,  0, 0      ), //;第16组F121
              LI(1, 0, 0, 0,  0, 0      ),
              LI(1, 0, 0, 0,  0, 0      ),
              LI(0, 0, 0, 0,  0, 0      ),
              LI(0, 0, 0, 0,  0, 0      ),
              LI(0, 0, 0, 0,  0, 0      ),
              LI(0, 0, 0, 0,  0, 0      ),
              LI(0, 1, 0, 0,  0, 0      ),              
              LI(1, 0, 0, 0,  0, 0      ), //;第17组F129
              LI(3, 0, 0, 0,  0, 0      ),
              LI(0, 0, 0, 0,  0, 0      ),
              LI(0, 0, 0, 0,  0, 0      ),
              LI(0, 0, 0, 0,  0, 0      ),
              LI(0, 0, 0, 0,  0, 0      ),
              LI(0, 0, 0, 0,  0, 0      ),
              LI(0, 0, 0, 0,  0, 0      ),              
              LI(0, 0, 0, 0,  0, 0      ), //;第18组F137
              LI(4, 0, 0, 0,  0, 0      ),
              LI(0, 0, 0, 0,  0, 0      ),
              LI(0, 0, 0, 0,  0, 0      ),
              LI(0, 0, 0, 0,  0, 0      ),
              LI(0, 0, 0, 0,  0, 0      ),
              LI(0, 0, 0, 0,  0, 0      ),
              LI(0, 1, 0, 0,  0, 0      ),              
              LI(4, 0, 0, 4,  0, CFP0F145), //;第19组F145
              LI(4, 0, 0, 4,  0, CFP0F146),
              LI(4, 0, 0, 4,  0, CFP0F147),
              LI(4, 0, 0, 4,  0, CFP0F148),
              LI(0, 0, 0, 0,  0, 0       ),
              LI(0, 0, 0, 0,  0, 0       ),
              LI(0, 0, 0, 0,  0, 0       ),
              LI(0, 0, 0, 0,  0, 0       ),              
              LI(1, 1, 0, 15, 1, DFP1F153), //;第20组F153
              LI(1, 1, 0, 12, 1, DFP1F154),
              LI(1, 1, 0, 15, 1, DFP1F155),
              LI(1, 1, 0, 12, 1, DFP1F156),
              LI(3, 1, 0, 15, 1, MFP1F157),
              LI(3, 1, 0, 12, 1, MFP1F158),
              LI(3, 1, 0, 15, 1, MFP1F159),
              LI(3, 1, 0, 12, 1, MFP1F160),              
              LI(1, 1, 1, 25, 0, DFP0F161), //;第21组F161
              LI(1, 1, 1, 20, 0, DFP0F162),
              LI(1, 1, 1, 25, 0, DFP0F163),
              LI(1, 1, 1, 20, 0, DFP0F164),
              LI(1, 1, 1, 20, 0, DFP0F165),
              LI(1, 1, 1, 20, 0, DFP0F166),
              LI(1, 1, 1, 20, 0, DFP0F167),
              LI(1, 1, 1, 20, 0, DFP0F168),           
              LI(2, 1, 1, 25, 0, RFP0F169), //;第22组F169
              LI(2, 1, 1, 20, 0, RFP0F170),
              LI(2, 1, 1, 25, 0, RFP0F171),
              LI(2, 1, 1, 20, 0, RFP0F172),
              LI(2, 1, 1, 20, 0, RFP0F173),
              LI(2, 1, 1, 20, 0, RFP0F174),
              LI(2, 1, 1, 20, 0, RFP0F175),
              LI(2, 1, 1, 20, 0, RFP0F176),              
              LI(3, 1, 1, 25, 0, MFP0F177), //;第23组F177
              LI(3, 1, 1, 20, 0, MFP0F178),
              LI(3, 1, 1, 25, 0, MFP0F179),
              LI(3, 1, 1, 20, 0, MFP0F180),
              LI(3, 1, 1, 20, 0, MFP0F181),
              LI(3, 1, 1, 20, 0, MFP0F182),
              LI(3, 1, 1, 20, 0, MFP0F183),
              LI(3, 1, 1, 20, 0, MFP0F184),              
              LI(1, 1, 1, 35, 0, DFP0F185), //;第24组F185
              LI(1, 1, 1, 35, 0, DFP0F186),
              LI(1, 1, 1, 35, 0, DFP0F187),
              LI(1, 1, 1, 35, 0, DFP0F188),
              LI(2, 1, 1, 35, 0, RFP0F189),
              LI(2, 1, 1, 35, 0, RFP0F190),
              LI(2, 1, 1, 35, 0, RFP0F191),
              LI(2, 1, 1, 35, 0, RFP0F192),              
              LI(3, 1, 1, 35, 0, MFP0F193), //;第25组F193
              LI(3, 1, 1, 35, 0, MFP0F194),
              LI(3, 1, 1, 35, 0, MFP0F195),
              LI(3, 1, 1, 35, 0, MFP0F196),
              LI(0, 0, 0, 0,  0, 0       ),
              LI(0, 0, 0, 0,  0, 0       ),
              LI(0, 0, 0, 0,  0, 0       ),
              LI(0, 0, 0, 0,  0, 0       ),             
/*              
              LI(3, 1, 1, 25, 1, MFP1F201), //;第26组F201
              LI(3, 1, 1, 25, 1, MFP1F202),
              LI(3, 1, 1, 25, 1, MFP1F203),
              LI(3, 1, 1, 25, 1, MFP1F204),
              LI(3, 1, 1, 25, 1, MFP1F205),
              LI(3, 1, 1, 25, 1, MFP1F206),
              LI(3, 1, 1, 25, 1, MFP1F207),
              LI(3, 1, 1, 25, 1, MFP1F208),              
*/
              LI(3, 0, 0, 0,  0, 0       ),     //;第26组F201 by zrt 20130816
              LI(3, 0, 0, 0,  0, 0       ),
              LI(3, 0, 0, 0,  0, 0       ),
              LI(3, 0, 0, 0,  0, 0       ),
              LI(3, 0, 0, 0,  0, 0       ),
              LI(3, 0, 0, 0,  0, 0       ),
              LI(3, 0, 0, 0,  0, 0       ),
              LI(3, 0, 0, 0,  0, 0       ), 
//              LI(1, 1, 0, 11, 1, DFP1F209), //;第27组F209        by zrt 20130826
              LI(1, 0, 0, 0,  0, 0       ),
              LI(0, 0, 0, 0,  0, 0       ),
              LI(0, 0, 0, 0,  0, 0       ),
              LI(0, 0, 0, 0,  0, 0       ),
              LI(3, 1, 0, 14, 1, MFP1F213),
              LI(3, 1, 0, 14, 1, MFP1F214),
              LI(3, 0, 0, 0,  0, 0       ),
              LI(3, 0, 0, 0,  0, 0       ),            
              LI(4, 0, 0, 0,  0, 0       ), //;第28组F217
              LI(4, 0, 0, 0,  0, 0       ),
              LI(0, 0, 0, 0,  0, 0       ),
              LI(0, 0, 0, 0,  0, 0       ),
              LI(0, 0, 0, 0,  0, 0       ),
              LI(0, 0, 0, 0,  0, 0       ),
              LI(0, 0, 0, 0,  0, 0       ),
              LI(0, 0, 0, 0,  0, 0       )           
              };                                        
//}    


///{//;645_07抄表用到的表格
/*------------------------------------------------------------------------*
   --L:  此数据标识包含数据长度
   --A： 数据在MeterData中的偏移字节数
 *------------------------------------------------------------------------*/
#define S(L,A)  L + A * 0x10000

/*******************************************************************************

                      2007数据在struct MeterData 中的偏移

 *******************************************************************************/
#define  L07_901F   7
#define  L07_902F   (L07_901F + 20)
#define  L07_911F   (L07_902F + 20)
#define  L07_912F   (L07_911F + 20)
#define  L07_913F   (L07_912F + 20)
#define  L07_914F   (L07_913F + 20)
#define  L07_915F   (L07_914F + 20)
#define  L07_916F   (L07_915F + 20)
#define  L07_30A1   (L07_916F + 20)
#define  L07_30B1   (L07_30A1 + 4)
#define  L07_30C1   (L07_30B1 + 4)

#define  L07_30A2   (L07_30C1+ 4)       //;by zrt 20130909
#define  L07_30B2   (L07_30A2 + 4)
#define  L07_30C2   (L07_30B2 + 4)

#define  L07_30A3   (L07_30C2+ 4)       //;by zrt 20130910
#define  L07_30B3   (L07_30A3+ 4)
#define  L07_30C3   (L07_30B3+ 4)

#define  L07_30A4   (L07_30C3+ 4)
#define  L07_30B4   (L07_30A4+ 4)
#define  L07_30C4   (L07_30B4+ 4)

#define  L07_941F   (L07_30C4 + 4)
#define  L07_942F   (L07_941F + 20)
#define  L07_951F   (L07_942F + 20)
#define  L07_952F   (L07_951F + 20)
#define  L07_953F   (L07_952F + 20)
#define  L07_954F   (L07_953F + 20)
#define  L07_955F   (L07_954F + 20)
#define  L07_956F   (L07_955F + 20)
#define  L07_31A1   (L07_956F + 20)
#define  L07_31B1   (L07_31A1 + 4)
#define  L07_31C1   (L07_31B1 + 4)

#define  L07_31A2   (L07_31C1 + 4)       //;by zrt 20130909
#define  L07_31B2   (L07_31A2 + 4)
#define  L07_31C2   (L07_31B2 + 4)

#define  L07_31A3   (L07_31C2 + 4)       //;by zrt 20130910
#define  L07_31B3   (L07_31A3 + 4)
#define  L07_31C3   (L07_31B3 + 4)

#define  L07_31A4   (L07_31C3+ 4)       //;by zrt 20130910
#define  L07_31B4   (L07_31A4 + 4)
#define  L07_31C4   (L07_31B4 + 4)

#define  L07_A01F   (L07_31C4 + 4)
#define  L07_A02F   (L07_A01F + 40)
#define  L07_A11F   (L07_A02F + 40)
#define  L07_A12F   (L07_A11F + 40)
#define  L07_A41F   (L07_A12F + 40)
#define  L07_A42F   (L07_A41F + 40)
#define  L07_A51F   (L07_A42F + 40)
#define  L07_A52F   (L07_A51F + 40)
#define  L07_C010   (L07_A52F + 40)
#define  L07_C011   (L07_C010 + 4)
#define  L07_B216   (L07_C011 + 3)
#define  L07_B212   (L07_B216 + 4)
#define  L07_B21A   (L07_B212 + 3)
#define  L07_B214   (L07_B21A + 6)
#define  L07_B21C   (L07_B214 + 3)
#define  L07_B213   (L07_B21C + 6)
#define  L07_B21B   (L07_B213 + 3)
#define  L07_B215   (L07_B21B + 6)
#define  L07_B21D   (L07_B215 + 3)
#define  L07_B217   (L07_B21D + 6)
#define  L07_B21F   (L07_B217 + 3)
#define  L07_B311   (L07_B21F + 10 + 3)
#define  L07_B312   (L07_B311 + 3)
#define  L07_B313   (L07_B312 + 3)
#define  L07_B321   (L07_B313 + 3 + 3)
#define  L07_B322   (L07_B321 + 3)
#define  L07_B323   (L07_B322 + 3)
#define  L07_B331   (L07_B323 + 3 + 6)
#define  L07_B332   (L07_B331 + 6)
#define  L07_B333   (L07_B332 + 6)
#define  L07_B341   (L07_B333 + 6 + 6)
#define  L07_B342   (L07_B341 + 6)
#define  L07_B343   (L07_B342 + 6)
#define  L07_B61F   (L07_B343 + 6)
#define  L07_B62F   (L07_B61F + 6)
#define  L07_B63F   (L07_B62F + 9)
#define  L07_B64F   (L07_B63F + 12)
#define  L07_B66F   (L07_B64F + 12)
#define  L07_B65F   (L07_B66F + 12)
#define  L07_B67F   (L07_B65F + 8)
#define  L07_C02F   (L07_B67F + 6)
//#define  L07_C030   (L07_C02F + 14)
#define  L07_C030   (L07_C02F + 15)
#define  L07_C031   (L07_C030 + 3)
#define  L07_C032   (L07_C031 + 3)
#define  L07_C117   (L07_C032 + 6)
#define  L07_C118   (L07_C117 + 2)
#define  L07_C119   (L07_C118 + 2)
#define  L07_C313   (L07_C119 + 2)
#define  L07_C141   (L07_C313 + 1)
#define  L07_C142   (L07_C141 + 6)
#define  L07_C14A   (L07_C142 + 6)
#define  L07_C040   (L07_C14A + 10)
#define  L07_C041   (L07_C040 + 3)
#define  L07_B710   (L07_C041 + 3)

#define  L07_B218   (L07_B710 + 3)        //;by zrt 20130814
#define  L07_B219   (L07_B218 + 3)

#define  L07_B220   (L07_B219 + 6)
#define  L07_B221   (L07_B220 + 3)

#define  L07_B222   (L07_B221 + 6)        //; by zrt 20130828
#define  L07_B223   (L07_B222 + 3)

#define  L07_B224   (L07_B223 + 6)        //;by zrt 20130910
/*
********************************************************************************

                                  DL/T 645—2007

********************************************************************************
*/
B4 DITab_2007[] = {
0x0001FF00,S(20, L07_901F),  //;(当前)正向有功电能数据块
0x0001FF01,S(20, L07_941F),  //;(上1结算日)正向有功总电能数据块
0x0002FF00,S(20, L07_902F),  //;(当前)反向有功电能数据块
0x0002FF01,S(20, L07_942F), 
0x0003FF00,S(20, L07_911F),  //;(当前)组合无功1电能数据块
0x0003FF01,S(20, L07_951F),
0x0004FF00,S(20, L07_912F),
0x0004FF01,S(20, L07_952F),
0x0005FF00,S(20, L07_913F),
0x0005FF01,S(20, L07_953F),
0x0006FF00,S(20, L07_915F),
0x0006FF01,S(20, L07_955F),
0x0007FF00,S(20, L07_916F),
0x0007FF01,S(20, L07_956F),
0x0008FF00,S(20, L07_914F),
0x0008FF01,S(20, L07_954F),
0x00150000,S(4,  L07_30A1), //;A相电能正向有功
0x00150001,S(4,  L07_31A1), //;上一结算日
0x00290000,S(4,  L07_30B1), //;B相电能
0x00290001,S(4,  L07_31B1),
0x003D0000,S(4,  L07_30C1), //;C相电能
0x003D0001,S(4,  L07_31C1),

0x00160000,S(4,  L07_30A2), //;A相电能反向有功by zrt 20130909
0x00160001,S(4,  L07_31A2), //;上一结算日
0x002A0000,S(4,  L07_30B2), //;B相电能
0x002A0001,S(4,  L07_31B2),
0x003E0000,S(4,  L07_30C2), //;C相电能
0x003E0001,S(4,  L07_31C2),

0x00170000,S(4,  L07_30A3), //;A相电能正向无功by zrt 20130910
0x00170001,S(4,  L07_31A3), //;上一结算日
0x002B0000,S(4,  L07_30B3), //;B相电能
0x002B0001,S(4,  L07_31B3),
0x003F0000,S(4,  L07_30C3), //;C相电能
0x003F0001,S(4,  L07_31C3),

0x00180000,S(4,  L07_30A4), //;A相电能反向无功by zrt 20130910
0x00180001,S(4,  L07_31A4), //;上一结算日
0x002C0000,S(4,  L07_30B4), //;B相电能
0x002C0001,S(4,  L07_31B4),
0x00400000,S(4,  L07_30C4), //;C相电能
0x00400001,S(4,  L07_31C4),
//;需量
0x0101FF00,S(40, L07_A01F), //;当前正向有功
0x0101FF01,S(40, L07_A41F), //;上月正向有功
0x0102FF00,S(40, L07_A02F), //;当前反向有功
0x0102FF01,S(40, L07_A42F), //;上月反向有功
0x0103FF00,S(40, L07_A11F), //;当前正向无功by zrt 20130923增加抄无功需量
0x0103FF01,S(40, L07_A51F), //;上月正向无功
0x0104FF00,S(40, L07_A12F), //;当前反向无功
0x0104FF01,S(40, L07_A52F), //;上月反向无功

0x0201FF00,S(6,  L07_B61F), //;瞬时值
0x0202FF00,S(9,  L07_B62F),
0x0203FF00,S(12, L07_B63F),
0x0204FF00,S(12, L07_B64F),
0x0205FF00,S(12, L07_B66F),
0x0206FF00,S(8,  L07_B65F),
0x0207FF00,S(6,  L07_B67F),
0x0280000A,S(4,  L07_B216), //;电池工作时间
0x03300000,S(3,  L07_B212), //;编程次数
0x03300001,S(6,  L07_B21A), //;最近一次编程发生时刻
0x03300100,S(3,  L07_B214), //;电表清零次数
0x03300101,S(6,  L07_B21C), //;最近一次清零发生时刻
0x03300200,S(3,  L07_B213), //;需量清零次数
0x03300201,S(6,  L07_B21B), //;最近一次需量清零发生时刻
0x03300300,S(3,  L07_B215), //;事件清零次数
0x03300301,S(6,  L07_B21D), //;最近一次事件清零发生时刻
0x03300400,S(3,  L07_B217), //;校时次数
0x03300401,S(10, L07_B21F), //;最近一次校时发生时刻 包含操作者代码4个字节

0x03300500,S(3,  L07_B224), //;费率时段表编程次数by zrt 20130910
//;0x04000101,S(4,  L07_C010), //;日期
//;0x04000102,S(3,  L07_C011), //;时间
0x04000204,S(1,  L07_C313), //;费率数
0x04000306,S(3,  L07_C040), //;电压互感器倍率
0x04000307,S(3,  L07_C041), //;电流互感器倍率
0x04000401,S(6,  L07_C032), //;通信地址
0x04000404,S(6,  L07_C141), //;额定电压
0x04000405,S(6,  L07_C142), //;额定电流
0x04000409,S(3,  L07_C030), //;有功常数
0x0400040A,S(3,  L07_C031), //;无功常数
0x0400040B,S(10, L07_C14A), //;电表型号
//0x040005FF,S(14, L07_C02F), //;电表运行状态
0x040005FF,S(15, L07_C02F), //;电表运行状态+1字节读事件状态by zrt 20130829
0x04000B01,S(2,  L07_C117), //;结算日1
0x04000B02,S(2,  L07_C118), //;结算日2
0x04000B03,S(2,  L07_C119), //;结算日3
0x10000001,S(3,  L07_B710), //;失压总次数
0x13010001,S(3,  L07_B311), //;A相断相次数
0x13010002,S(3,  L07_B321), //;A相断相时间
0x13010101,S(6,  L07_B331), //;A相断相起始时间
0x13012501,S(6,  L07_B341), //;A相断相结束时间
0x13020001,S(3,  L07_B312), //;B相断相次数
0x13020002,S(3,  L07_B322), //;B相断相时间
0x13020101,S(6,  L07_B332), //;B相断相起始时间
0x13022501,S(6,  L07_B342), //;B相断相结束时间
0x13030001,S(3,  L07_B313), //;C相断相次数
0x13030002,S(3,  L07_B323), //;C相断相时间
0x13030101,S(6,  L07_B333), //;C相断相起始时间
0x13032501,S(6,  L07_B343), //;C相断相结束时间

0x03300E00,S(3,  L07_B218), //;开端盖总次数   by zrt 20130808
0x03300E01,S(6,  L07_B219), //;最近一次开端盖时间

0x03300500,S(3,  L07_B220), //;电能表时段参数修改次数by zrt 20130814
0x03300501,S(6,  L07_B221), //;最近一次电能表时段参数修改时间

0x03110000,S(3,  L07_B222), //;掉电总次数   by zrt 20130828
0x03110001,S(6,  L07_B223), //;最近一次掉电发生时间

0x04000101,S(4,  L07_C010), //;日期   by zrt 20130906  最后抄表日期时间防止抄回表时间和模块时间相差太多
0x04000102,S(3,  L07_C011), //;时间
};
//}



///{//;645_97抄表用到的表格

/*******************************************************************************

                      97数据在struct MeterData 中的偏移

 *******************************************************************************/
#define  L97_901F   7
#define  L97_902F   (L97_901F + 20)
#define  L97_911F   (L97_902F + 20)
#define  L97_912F   (L97_911F + 20)
#define  L97_913F   (L97_912F + 20)
#define  L97_914F   (L97_913F + 20)
#define  L97_915F   (L97_914F + 20)
#define  L97_916F   (L97_915F + 20)
#define  L97_941F   (L97_916F + 20 + 15) //;15为分相有功电能所用字节
#define  L97_942F   (L97_941F + 20)
#define  L97_951F   (L97_942F + 20)
#define  L97_952F   (L97_951F + 20)
#define  L97_953F   (L97_952F + 20)
#define  L97_954F   (L97_953F + 20)
#define  L97_955F   (L97_954F + 20)
#define  L97_956F   (L97_955F + 20)
#define  L97_A01F   (L97_956F + 20 + 15) //;15为分相有功电能所用字节
#define  L97_B01F   (L97_A01F + 3)
#define  L97_A02F   (L97_A01F + 40)
#define  L97_B02F   (L97_A02F + 3)
#define  L97_A11F   (L97_A02F + 40)
#define  L97_B11F   (L97_A11F + 3)
#define  L97_A12F   (L97_A11F + 40)
#define  L97_B12F   (L97_A12F + 3)
#define  L97_A41F   (L97_A12F + 40)
#define  L97_B41F   (L97_A41F + 3)
#define  L97_A42F   (L97_A41F + 40)
#define  L97_B42F   (L97_A42F + 3)
#define  L97_A51F   (L97_A42F + 40)
#define  L97_B51F   (L97_A51F + 3)
#define  L97_A52F   (L97_A51F + 40)
#define  L97_B52F   (L97_A52F + 3)
#define  L97_C010   (L97_A52F + 40)
#define  L97_C011   (L97_C010 + 4)
#define  L97_B217   (L97_C011 + 3)
#define  L97_B212   (L97_B217 + 4)
#define  L97_B210   (L97_B212 + 3)
#define  L97_B213   (L97_B210 + 6 + 9) //;9为电表清零记录字节数
#define  L97_B211   (L97_B213 + 3)
#define  L97_B31F   (L97_B211 + 6 + 9 + 13) //;9和13分别为时间清零和校时
#define  L97_B32F   (L97_B31F + 12)
#define  L97_B330   (L97_B32F + 12)
#define  L97_B331   (L97_B330 + 6)
#define  L97_B332   (L97_B331 + 6)
#define  L97_B333   (L97_B332 + 6)
#define  L97_B340   (L97_B333 + 6)
#define  L97_B341   (L97_B340 + 6)
#define  L97_B342   (L97_B341 + 6)
#define  L97_B343   (L97_B342 + 6)
#define  L97_B61F   (L97_B343 + 6)
#define  L97_B621   (L97_B61F + 6)
#define  L97_B622   (L97_B621 + 3)
#define  L97_B623   (L97_B622 + 3)
#define  L97_B63F   (L97_B623 + 3)
#define  L97_B64F   (L97_B61F + 12)
#define  L97_B66F   (L97_B64F + 12)
#define  L97_B65F   (L97_B66F + 12)
#define  L97_C020   (L97_B65F + 8 + 6) //;6为相位角所用字节
#define  L97_C030   (L97_C020 + 14)
#define  L97_C031   (L97_C030 + 3)
#define  L97_C032   (L97_C031 + 3)
#define  L97_C117   (L97_C032 + 6)
#define  L97_C313   (L97_C117 + 6)
#define  L97_C141   (L97_C313 + 1)
#define  L97_C142   (L97_C141 + 6)
#define  L97_B710   (L97_C142 + 6 + 10 + 6)


/*
********************************************************************************

                                  DL/T 645—1997

********************************************************************************
*/
B4 DITab_1997[] = {
0x901F, S(20, L97_901F), //;电能
0x902F, S(20, L97_902F),
0x911F, S(20, L97_911F),
0x912F, S(20, L97_912F),
0x913F, S(20, L97_913F),
0x914F, S(20, L97_914F),
0x915F, S(20, L97_915F),
0x916F, S(20, L97_916F),
0x941F, S(20, L97_941F),
0x942F, S(20, L97_942F),
0x951F, S(20, L97_951F),
0x952F, S(20, L97_952F),
0x953F, S(20, L97_953F),
0x954F, S(20, L97_954F),
0x955F, S(20, L97_955F),
0x956F, S(20, L97_956F),
0xA01F, S(0xF5, L97_A01F), //;需量
0xA02F, S(0xF5, L97_A02F),
0xA11F, S(0xF5, L97_A11F),
0xA12F, S(0xF5, L97_A12F),
0xA41F, S(0xF5, L97_A41F),
0xA42F, S(0xF5, L97_A42F),
0xA51F, S(0xF5, L97_A51F),
0xA52F, S(0xF5, L97_A52F),
0xB01F, S(0xF3, L97_B01F),
0xB02F, S(0xF3, L97_B02F),
0xB11F, S(0xF3, L97_B11F),
0xB12F, S(0xF3, L97_B12F),
0xB210, S(4,  L97_B210), //;最近一次编程时间
0xB211, S(4,  L97_B211), //;最近一次需量清零时间
0xB212, S(2,  L97_B212), //;编程次数
0xB213, S(2,  L97_B213), //;需量清零次数
0xB217, S(3,  L97_B217), //;电池工作时间
0xB31F, S(8,  L97_B31F), //;断相次数
0xB32F, S(12,  L97_B32F),//;断相时间
0xB330, S(4,  L97_B330),//;断相起始时刻
0xB331, S(4,  L97_B331),
0xB332, S(4,  L97_B332),
0xB333, S(4,  L97_B333),
0xB340, S(4,  L97_B340),//;断相结束时刻
0xB341, S(4,  L97_B341),
0xB342, S(4,  L97_B342),
0xB343, S(4,  L97_B343),
0xB41F, S(0xF3, L97_B41F), //;需量发生时间
0xB42F, S(0xF3, L97_B42F),
0xB51F, S(0xF3, L97_B51F),
0xB52F, S(0xF3, L97_B52F),
0xB61F, S(6,  L97_B61F), //;电压
0xB621, S(2,  L97_B621), //;电流，字节不同，故单个抄表
0xB622, S(2,  L97_B622),
0xB623, S(2,  L97_B623),
0xB63F, S(12,  L97_B63F), //;有功功率
0xB64F, S(8,  L97_B64F),  //;无功功率
0xB65F, S(8,  L97_B65F), //;功率因数
0xB66F, S(8,  L97_B66F), //;视在功率
0xB710, S(2,  L97_B710), //;失压总次数
0xC010, S(4,  L97_C010), //;时间日期
0xC011, S(3,  L97_C011),
0xC020, S(1,  L97_C020), //;电表运行状态字
0xC030, S(3,  L97_C030), //;电表常数
0xC031, S(3,  L97_C031),
0xC032, S(6,  L97_C032),
//;0xC040, S(4,  L97_C040), //;电压互感器倍率
//;0xC041, S(3,  L97_C041), //;电流互感器倍率
0xC117, S(2,  L97_C117), //;自动抄表日
0xC141, S(3,  L97_C141), //;标定电压
0xC142, S(3,  L97_C142), //;标定电流
0xC313, S(1,  L97_C313), //;费率数

};
//}



///{//;小时冻结用到的表格
B2 PnHDJ_Adr[28] ={\
_T1NF89, _T1NF90, _T1NF91, _T1NF92,
_T1NF93, _T1NF94, _T1NF95, _T1NF96,
_T1NF97, _T1NF98, _T1NF99, _T1NF100,
_T1NF101,_T1NF102,_T1NF103,0,_T1NF105,
_T1NF106,_T1NF107,_T1NF108,_T1NF109,
_T1NF110,_T1NF111,_T1NF112,_T1NF113,
_T1NF114,_T1NF115,_T1NF116};
//}
